In [ ]:
""" PANDAS PRACTICE QUESTION """

In [ ]:
""" Loading a csv in Pandas
Description
Create a dataframe from the file ‘marks.csv’ and print the contents of the dataframe. 
Open the file from the link above and inspect the required elements in the file (header, separator, etc.). 
If the top row is a regular entry, do not load it as the column header. """

In [7]:
import numpy as np
import pandas as pd

# The file is stored at the following path:
# 'https://media-doselect.s3.amazonaws.com/generic/A08MajL8qN4rq72EpVJbAP1Rw/marks_1.csv'
# Provide your answer below
df = pd.read_csv("https://media-doselect.s3.amazonaws.com/generic/A08MajL8qN4rq72EpVJbAP1Rw/marks_1.csv",delimiter="|",header=None)# Write your answer here

print(df)

     0        1            2   3   4   5
0    1   Akshay  Mathematics  50  40  80
1    2   Mahima      English  40  33  83
2    3    Vikas  Mathematics  50  42  84
3    4  Abhinav      English  40  31  78
4    5   Mahima      Science  50  40  80
5    6   Akshay      Science  50  49  98
6    7  Abhinav  Mathematics  50  47  94
7    8    Vikas      Science  50  40  80
8    9  Abhinav      Science  50  47  94
9   10    Vikas      English  40  39  98
10  11   Akshay      English  40  35  88
11  12   Mahima  Mathematics  50  43  86

In [ ]:
""" Using the file ‘marks.csv’, create a dataframe as shown below.

You must be able make the first column of the file as the index and name it 'S.No.'. Also, the columns must be renamed as shown in the image. """

In [29]:
import numpy as np
import pandas as pd

# The file is stored at the following path:
# 'https://media-doselect.s3.amazonaws.com/generic/A08MajL8qN4rq72EpVJbAP1Rw/marks_1.csv'
# Provide your answer below
df = pd.read_csv("marks_1.csv",sep="|",header=None,index_col=0)# Write your answer here
df.columns = ["Name","Subject","Maximum Marks","Marks Obtained","Percentage"]
df.index.name="S.No."
print(df)

          Name      Subject  Maximum Marks  Marks Obtained  Percentage
S.No.
1       Akshay  Mathematics             50              40          80
2       Mahima      English             40              33          83
3        Vikas  Mathematics             50              42          84
4      Abhinav      English             40              31          78
5       Mahima      Science             50              40          80
6       Akshay      Science             50              49          98
7      Abhinav  Mathematics             50              47          94
8        Vikas      Science             50              40          80
9      Abhinav      Science             50              47          94
10       Vikas      English             40              39          98
11      Akshay      English             40              35          88
12      Mahima  Mathematics             50              43          86

In [ ]:
""" Hierarchical Indexing
Description
You are provided with the dataset of a company which has offices across three cities - Mumbai, Bangalore and New Delhi. The dataset contains the rating (out of 5) of all the employees from different departments (Finance, HR, Marketing and Sales). 

Create a hierarchical index based on two columns: Office and Department

Print the first 5 rows as the output. Refer to the image below for your reference.

Note: You should not sort or modify values in other columns of the dataframe. Use sort_index(inplace=True) to club the same locations together. """

In [38]:
import numpy as np
import pandas as pd

# The file is stored at the following path:
# 'https://media-doselect.s3.amazonaws.com/generic/NMgEjwkAEGGQZBoNYGr9Ld7w0/rating.csv'
df = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/NMgEjwkAEGGQZBoNYGr9Ld7w0/rating.csv',index_col=[2,1])

# Provide your answer below
df.sort_index(inplace=True)
print(df.head(5))

                         ID  Rating
Office    Department
Bangalore Finance     U2F53     2.7
          Finance     U1F53     3.7
          Finance     U1F28     3.2
          Finance     U1F15     3.3
          Finance     U1F14     2.9

In [ ]:
""" Description
Given a dataframe 'df' use the following commands and analyse the result.
describe() 
columns
shape
Execution Time Limit """

In [39]:
import numpy as np
import pandas as pd
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
df = pd.read_csv('https://query.data.world/s/vBDCsoHCytUSLKkLvq851k2b8JOCkF')
print(df.describe())#Type your code for describing the dataset)
print(df.columns)#Type your code for printing the columns of the dataset)
print(df.shape)#Type your code for printing the shape of the dataset)

                X           Y        FFMC         DMC          DC         ISI  \
count  517.000000  517.000000  517.000000  517.000000  517.000000  517.000000
mean     4.669246    4.299807   90.644681  110.872340  547.940039    9.021663
std      2.313778    1.229900    5.520111   64.046482  248.066192    4.559477
min      1.000000    2.000000   18.700000    1.100000    7.900000    0.000000
25%      3.000000    4.000000   90.200000   68.600000  437.700000    6.500000
50%      4.000000    4.000000   91.600000  108.300000  664.200000    8.400000
75%      7.000000    5.000000   92.900000  142.400000  713.900000   10.800000
max      9.000000    9.000000   96.200000  291.300000  860.600000   56.100000

             temp          RH        wind        rain         area
count  517.000000  517.000000  517.000000  517.000000   517.000000
mean    18.889168   44.288201    4.017602    0.021663    12.847292
std      5.806625   16.317469    1.791653    0.295959    63.655818
min      2.200000   15.000000    0.400000    0.000000     0.000000
25%     15.500000   33.000000    2.700000    0.000000     0.000000
50%     19.300000   42.000000    4.000000    0.000000     0.520000
75%     22.800000   53.000000    4.900000    0.000000     6.570000
max     33.300000  100.000000    9.400000    6.400000  1090.840000
Index(['X', 'Y', 'month', 'day', 'FFMC', 'DMC', 'DC', 'ISI', 'temp', 'RH',
       'wind', 'rain', 'area'],
      dtype='object')
(517, 13)

In [ ]:
""" Selecting Columns of a Dataframe
Description
Print out the columns 'month', 'day', 'temp', 'area' from the dataframe 'df'. """

In [41]:
import pandas as pd
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
df = pd.read_csv('https://query.data.world/s/vBDCsoHCytUSLKkLvq851k2b8JOCkF')
df_2 = df[['month', 'day' , 'temp' , 'area']]#Type your code for selecting columns 'month', 'day' , 'temp' , 'area'
print(df_2.head(20))

   month  day  temp  area
0    mar  fri   8.2   0.0
1    oct  tue  18.0   0.0
2    oct  sat  14.6   0.0
3    mar  fri   8.3   0.0
4    mar  sun  11.4   0.0
5    aug  sun  22.2   0.0
6    aug  mon  24.1   0.0
7    aug  mon   8.0   0.0
8    sep  tue  13.1   0.0
9    sep  sat  22.8   0.0
10   sep  sat  17.8   0.0
11   sep  sat  19.3   0.0
12   aug  fri  17.0   0.0
13   sep  mon  21.3   0.0
14   sep  wed  26.4   0.0
15   sep  fri  22.9   0.0
16   mar  sat  15.1   0.0
17   oct  mon  16.7   0.0
18   mar  wed  15.9   0.0
19   apr  sat   9.3   0.0

In [ ]:
""" Description
Print only the even numbers of rows of the dataframe 'df'.

Note: Don't include the row indexed zero.
Execution Time Limit """

In [52]:
import pandas as pd
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
df = pd.read_csv('https://query.data.world/s/vBDCsoHCytUSLKkLvq851k2b8JOCkF')
df_2 = df[2::2]#Type your code here for indexing the dataframe
print(df_2.head(20))

    X  Y month  day  FFMC    DMC     DC   ISI  temp  RH  wind  rain  area
2   7  4   oct  sat  90.6   43.7  686.9   6.7  14.6  33   1.3   0.0   0.0
4   8  6   mar  sun  89.3   51.3  102.2   9.6  11.4  99   1.8   0.0   0.0
6   8  6   aug  mon  92.3   88.9  495.6   8.5  24.1  27   3.1   0.0   0.0
8   8  6   sep  tue  91.0  129.5  692.6   7.0  13.1  63   5.4   0.0   0.0
10  7  5   sep  sat  92.5   88.0  698.6   7.1  17.8  51   7.2   0.0   0.0
12  6  5   aug  fri  63.5   70.8  665.3   0.8  17.0  72   6.7   0.0   0.0
14  6  5   sep  wed  92.9  133.3  699.6   9.2  26.4  21   4.5   0.0   0.0
16  5  5   mar  sat  91.7   35.8   80.8   7.8  15.1  27   5.4   0.0   0.0
18  6  4   mar  wed  89.2   27.9   70.8   6.3  15.9  35   4.0   0.0   0.0
20  6  4   sep  tue  91.0  129.5  692.6   7.0  18.3  40   2.7   0.0   0.0
22  7  4   jun  sun  94.3   96.3  200.0  56.1  21.0  44   4.5   0.0   0.0
24  7  4   aug  sat  93.5  139.4  594.2  20.3  23.7  32   5.8   0.0   0.0
26  7  4   sep  fri  92.4  117.9  668.0  12.2  19.0  34   5.8   0.0   0.0
28  6  3   sep  sat  93.4  145.4  721.4   8.1  30.2  24   2.7   0.0   0.0
30  6  3   sep  fri  94.3   85.1  692.3  15.9  25.4  24   3.6   0.0   0.0
32  6  3   sep  fri  88.6   69.7  706.8   5.8  20.6  37   1.8   0.0   0.0
34  6  3   sep  mon  91.8   78.5  724.3   9.2  21.2  32   2.7   0.0   0.0
36  6  3   oct  tue  90.6   35.4  669.1   6.7  21.7  24   4.5   0.0   0.0
38  7  3   oct  sat  90.6   43.7  686.9   6.7  17.8  27   4.0   0.0   0.0
40  4  4   jul  tue  79.5   60.6  366.7   1.5  23.3  37   3.1   0.0   0.0

In [ ]:
""" Applying Conditions on Dataframes
Description
Print all the columns and the rows where 'area' is greater than 0, 'wind' is greater than 1 and the 'temp' is greater than 15. """

In [60]:
import pandas as pd
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
df = pd.read_csv('https://query.data.world/s/vBDCsoHCytUSLKkLvq851k2b8JOCkF')
df_2 = df[(df["area"]>0)&(df["wind"]>1)&(df["temp"]>15)]#Type your code here.
print(df_2.head(20))

     X  Y month  day  FFMC    DMC     DC   ISI  temp  RH  wind  rain  area
138  9  9   jul  tue  85.8   48.3  313.4   3.9  18.0  42   2.7   0.0  0.36
139  1  4   sep  tue  91.0  129.5  692.6   7.0  21.7  38   2.2   0.0  0.43
140  2  5   sep  mon  90.9  126.5  686.5   7.0  21.9  39   1.8   0.0  0.47
141  1  2   aug  wed  95.5   99.9  513.3  13.2  23.3  31   4.5   0.0  0.55
142  8  6   aug  fri  90.1  108.0  529.8  12.5  21.2  51   8.9   0.0  0.61
143  1  2   jul  sat  90.0   51.3  296.3   8.7  16.6  53   5.4   0.0  0.71
144  2  5   aug  wed  95.5   99.9  513.3  13.2  23.8  32   5.4   0.0  0.77
145  6  5   aug  thu  95.2  131.7  578.8  10.4  27.4  22   4.0   0.0  0.90
147  8  3   sep  tue  84.4   73.4  671.9   3.2  24.2  28   3.6   0.0  0.96
148  2  2   aug  tue  94.8  108.3  647.1  17.0  17.4  43   6.7   0.0  1.07
149  8  6   sep  thu  93.7   80.9  685.2  17.9  23.7  25   4.5   0.0  1.12
150  6  5   jun  fri  92.5   56.4  433.3   7.1  23.2  39   5.4   0.0  1.19
151  9  9   jul  sun  90.1   68.6  355.2   7.2  24.8  29   2.2   0.0  1.36
152  3  4   jul  sat  90.1   51.2  424.1   6.2  24.6  43   1.8   0.0  1.43
153  5  4   sep  fri  94.3   85.1  692.3  15.9  20.1  47   4.9   0.0  1.46
154  1  5   sep  sat  93.4  145.4  721.4   8.1  29.6  27   2.7   0.0  1.46
155  7  4   aug  sun  94.8  108.3  647.1  17.0  16.4  47   1.3   0.0  1.56
156  2  4   sep  sat  93.4  145.4  721.4   8.1  28.6  27   2.2   0.0  1.61
157  2  2   aug  wed  92.1  111.2  654.1   9.6  18.4  45   3.6   0.0  1.63
158  2  4   aug  wed  92.1  111.2  654.1   9.6  20.5  35   4.0   0.0  1.64

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 517 entries, 0 to 516
Data columns (total 13 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       517 non-null    int64
 1   Y       517 non-null    int64
 2   month   517 non-null    object
 3   day     517 non-null    object
 4   FFMC    517 non-null    float64
 5   DMC     517 non-null    float64
 6   DC      517 non-null    float64
 7   ISI     517 non-null    float64
 8   temp    517 non-null    float64
 9   RH      517 non-null    int64
 10  wind    517 non-null    float64
 11  rain    517 non-null    float64
 12  area    517 non-null    float64
dtypes: float64(8), int64(3), object(2)
memory usage: 52.6+ KB

In [ ]:
""" Employee Training
Description
You are provided with the dataset of a company which has offices across three cities - Mumbai, Bangalore and New Delhi. The dataset contains the rating (out of 5) of all the employees from different departments (Finance, HR, Marketing and Sales). 



The company has come up with a new policy that any individual with a rating equal to or below 3.5 needs to attend a training. Using dataframes, load the dataset and then derive the column ‘Training’ which shows ‘Yes’ for people who require training and ‘No’ for those who do not.

Print the first 5 rows as the output. Refer to the image below for your reference.

Note: You should not sort or modify values in other columns of the dataframe. """

In [63]:
import numpy as np
import pandas as pd

# The file is stored at the following path:
# 'https://media-doselect.s3.amazonaws.com/generic/NMgEjwkAEGGQZBoNYGr9Ld7w0/rating.csv'
df = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/NMgEjwkAEGGQZBoNYGr9Ld7w0/rating.csv')
df["Training"] = df.Rating.apply(lambda x: "Yes" if x<=3.5 else "No")
# Provide your answer below

print(df.head())

      ID Department     Office  Rating Training
0  U2F26    Finance  New Delhi     3.4      Yes
1  U2M61  Marketing  New Delhi     3.9       No
2  U1S15      Sales  New Delhi     2.8      Yes
3  U1H87         HR     Mumbai     2.1      Yes
4  U1S51      Sales  New Delhi     4.6       No

In [65]:
pd.crosstab(df["Department"],df["Training"])

Training    No  Yes
Department
Finance     67   67
HR          75   56
Marketing   64   74
Sales       64   66

In [66]:
for i in ['Finance', 'HR', 'Sales', 'Marketing']:
    print(i, len(rating[(rating['Training'] == 'No') & (rating['Department'] == i)]) / len(rating[rating['Department'] == i]) * 100)

NameError: name 'rating' is not defined

In [4]:
""" Dataframe grouping
Description
Group the dataframe 'df' by 'month' and 'day' and find the mean value for column 'rain' and 'wind'. """
import pandas as pd
df = pd.read_csv('https://query.data.world/s/vBDCsoHCytUSLKkLvq851k2b8JOCkF')
df

     X  Y month  day  FFMC    DMC     DC   ISI  temp  RH  wind  rain   area
0    7  5   mar  fri  86.2   26.2   94.3   5.1   8.2  51   6.7   0.0   0.00
1    7  4   oct  tue  90.6   35.4  669.1   6.7  18.0  33   0.9   0.0   0.00
2    7  4   oct  sat  90.6   43.7  686.9   6.7  14.6  33   1.3   0.0   0.00
3    8  6   mar  fri  91.7   33.3   77.5   9.0   8.3  97   4.0   0.2   0.00
4    8  6   mar  sun  89.3   51.3  102.2   9.6  11.4  99   1.8   0.0   0.00
..  .. ..   ...  ...   ...    ...    ...   ...   ...  ..   ...   ...    ...
512  4  3   aug  sun  81.6   56.7  665.6   1.9  27.8  32   2.7   0.0   6.44
513  2  4   aug  sun  81.6   56.7  665.6   1.9  21.9  71   5.8   0.0  54.29
514  7  4   aug  sun  81.6   56.7  665.6   1.9  21.2  70   6.7   0.0  11.16
515  1  4   aug  sat  94.4  146.0  614.7  11.3  25.6  42   4.0   0.0   0.00
516  6  3   nov  tue  79.5    3.0  106.7   1.1  11.8  31   4.5   0.0   0.00

[517 rows x 13 columns]

In [5]:
import pandas as pd
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
df = pd.read_csv('https://query.data.world/s/vBDCsoHCytUSLKkLvq851k2b8JOCkF')
#Type your groupby command here
col =["rain","wind"]
df_1 = df.groupby(["month","day"])[col].mean()    #Type your code to find the mean of columns 'rain' and 'wind'
print(df_1.head(20))

               rain      wind
month day
apr   fri  0.000000  3.100000
      mon  0.000000  3.100000
      sat  0.000000  4.500000
      sun  0.000000  5.666667
      thu  0.000000  5.800000
      wed  0.000000  2.700000
aug   fri  0.066667  4.766667
      mon  0.000000  2.873333
      sat  0.000000  4.310345
      sun  0.025000  4.417500
      thu  0.000000  3.503846
      tue  0.300000  4.567857
      wed  0.000000  3.520000
dec   fri  0.000000  4.900000
      mon  0.000000  8.500000
      sun  0.000000  8.500000
      thu  0.000000  4.900000
      tue  0.000000  8.500000
      wed  0.000000  8.000000
feb   fri  0.000000  4.820000

In [ ]:
""" Dataframes Merge
Description
Perform an inner merge on two data frames df_1 and df_2 on  'unique_id' and print the combined dataframe.
Execution Time Limit
20 seconds """

In [10]:
import pandas as pd
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
df_1 = pd.read_csv('https://query.data.world/s/vv3snq28bp0TJq2ggCdxGOghEQKPZo')
df_2 = pd.read_csv('https://query.data.world/s/9wVKjNT0yiRc3YbVJaiI8a6HGl2d74')
df_3 = df_1.merge(df_2,on="unique_id",how="inner")#Type your code here.
print(df_3.head(20))

                           name                     address              city  \
0     arnie morton's of chicago   "435 s. la cienega blvd."     "los angeles"
1                    art's deli       "12224 ventura blvd."     "studio city"
2                 bel-air hotel      "701 stone canyon rd."         "bel air"
3                    cafe bizou       "14016 ventura blvd."    "sherman oaks"
4                     campanile       "624 s. la brea ave."     "los angeles"
5               chinois on main             "2709 main st."    "santa monica"
6                        citrus         "6703 melrose ave."     "los angeles"
7           fenix at the argyle         "8358 sunset blvd."    "w. hollywood"
8                       granita       "23725 w. malibu rd."          "malibu"
9                    grill  the           "9560 dayton way"   "beverly hills"
10                        katsu       "1972 hillhurst ave."       "los feliz"
11                  l'orangerie   "903 n. la cienega blvd."    "w. hollywood"
12  le chardonnay (los angeles)         "8284 melrose ave."     "los angeles"
13               locanda veneta         "8638 w. third st."     "los angeles"
14                    matsuhisa   "129 n. la cienega blvd."   "beverly hills"
15      palm  the (los angeles)   "9001 santa monica blvd."    "w. hollywood"
16                       patina         "5955 melrose ave."     "los angeles"
17        philippe the original       "1001 n. alameda st."       "chinatown"
18                 pinot bistro       "12969 ventura blvd."     "studio city"
19            rex il ristorante          "617 s. olive st."     "los angeles"

                      cuisine unique_id                     name_2  \
0               "steakhouses"       '0'  arnie morton's of chicago
1                     "delis"       '1'         art's delicatessen
2               "californian"       '2'              hotel bel-air
3             "french bistro"       '3'                 cafe bizou
4               "californian"       '4'                  campanile
5          "pacific new wave"       '5'            chinois on main
6               "californian"       '6'                     citrus
7              "french (new)"       '7'                      fenix
8               "californian"       '8'                    granita
9    "american (traditional)"       '9'         grill on the alley
10                 "japanese"      '10'           restaurant katsu
11         "french (classic)"      '11'                l'orangerie
12            "french bistro"      '12'              le chardonnay
13                  "italian"      '13'             locanda veneta
14                  "seafood"      '14'                  matsuhisa
15              "steakhouses"      '15'                   the palm
16              "californian"      '16'                     patina
17               "cafeterias"      '17'    philippe's the original
18            "french bistro"      '18'               pinot bistro
19     "nuova cucina italian"      '19'          rex il ristorante

                     address_2            city_2       cuisine_2
0     "435 s. la cienega blv."     "los angeles"      "american"
1        "12224 ventura blvd."     "studio city"      "american"
2       "701 stone canyon rd."         "bel air"   "californian"
3        "14016 ventura blvd."    "sherman oaks"        "french"
4        "624 s. la brea ave."     "los angeles"      "american"
5              "2709 main st."    "santa monica"        "french"
6          "6703 melrose ave."     "los angeles"   "californian"
7     "8358 sunset blvd. west"       "hollywood"      "american"
8        "23725 w. malibu rd."          "malibu"   "californian"
9            "9560 dayton way"     "los angeles"      "american"
10    "1972 n. hillhurst ave."     "los angeles"         "asian"
11   "903 n. la cienega blvd."     "los angeles"        "french"
12         "8284 melrose ave."     "los angeles"        "french"
13                   "3rd st."     "los angeles"       "italian"
14   "129 n. la cienega blvd."   "beverly hills"         "asian"
15   "9001 santa monica blvd."     "los angeles"      "american"
16         "5955 melrose ave."     "los angeles"   "californian"
17       "1001 n. alameda st."     "los angeles"      "american"
18       "12969 ventura blvd."     "los angeles"        "french"
19          "617 s. olive st."     "los angeles"       "italian"

In [ ]:
""" Operations on multiple dataframes
Description
Given three data frames containing the number of gold, silver, and bronze Olympic medals won by some countries, 
determine the total number of medals won by each country. 

Note: All three data frames don’t have all the same countries. So, ensure you use the ‘fill_value’ argument (set it to zero),
 to avoid getting NaN values. Also, ensure you sort the final data frame,
 according to the total medal count in descending order. Make sure that the results are in integers. """

In [46]:
import numpy as np 
import pandas as pd

# Defining the three dataframes indicating the gold, silver, and bronze medal counts
# of different countries
gold = pd.DataFrame({'Country': ['USA', 'France', 'Russia'],
                         'Medals': [15, 13, 9]}
                    )
silver = pd.DataFrame({'Country': ['USA', 'Germany', 'Russia'],
                        'Medals': [29, 20, 16]}
                    )
bronze = pd.DataFrame({'Country': ['France', 'USA', 'UK'],
                        'Medals': [40, 28, 27]}
                    )


outputdf = gold.merge(silver,on="Country",how='outer').merge(bronze,on="Country",how='outer').fillna(0)
outputdf["Medals"] = outputdf["Medals"] + outputdf["Medals_x"] + outputdf["Medals_y"]
finaldf = outputdf.sort_values('Medals',ascending = False)[["Country","Medals"]].set_index("Country").astype('Int64')
finaldf

         Medals
Country
USA          72
France       53
UK           27
Russia       25
Germany      20

In [ ]:
""" Dataframe Append
Description
Append two datasets df_1 and df_2, and print the combined dataframe.

Execution Time Limit """

In [58]:
# Suppressing warnings
import warnings
warnings.simplefilter("ignore")

import pandas as pd
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
df_1 = pd.read_csv('https://query.data.world/s/vv3snq28bp0TJq2ggCdxGOghEQKPZo')
df_2 = pd.read_csv('https://query.data.world/s/9wVKjNT0yiRc3YbVJaiI8a6HGl2d74')
df_3 = pd.concat([df_1,df_2],axis=0)#Type your code here.
print(df_3.head())

                        name                     address             city  \
0  arnie morton's of chicago   "435 s. la cienega blvd."    "los angeles"
1                 art's deli       "12224 ventura blvd."    "studio city"
2              bel-air hotel      "701 stone canyon rd."        "bel air"
3                 cafe bizou       "14016 ventura blvd."   "sherman oaks"
4                  campanile       "624 s. la brea ave."    "los angeles"

            cuisine unique_id name_2 address_2 city_2 cuisine_2
0     "steakhouses"       '0'    NaN       NaN    NaN       NaN
1           "delis"       '1'    NaN       NaN    NaN       NaN
2     "californian"       '2'    NaN       NaN    NaN       NaN
3   "french bistro"       '3'    NaN       NaN    NaN       NaN
4     "californian"       '4'    NaN       NaN    NaN       NaN

In [ ]:
""" Dataframe Pivot Table
Description
Group the data 'df' by 'month' and 'day' and find the mean value for column 'rain' and 'wind' using the pivot table command. """
#df.pivot(columns='grouping_variable_col', values='value_to_aggregate', index='grouping_variable_row')
#df.pivot_table(values, index, aggfunc={'value_1': np.mean,'value_2': [min, max, np.mean]})

In [78]:
import numpy as np
import pandas as pd
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
df = pd.read_csv('https://query.data.world/s/vBDCsoHCytUSLKkLvq851k2b8JOCkF')
df_1 = df.pivot_table(index=['month','day'],values=['rain','wind'],aggfunc=np.mean)#Type your code here. 
#df_1 = pd.pivot_table(df, values=['rain', 'wind'], index=['month', 'day'], aggfunc='mean')
print(df_1.head(20))

               rain      wind
month day
apr   fri  0.000000  3.100000
      mon  0.000000  3.100000
      sat  0.000000  4.500000
      sun  0.000000  5.666667
      thu  0.000000  5.800000
      wed  0.000000  2.700000
aug   fri  0.066667  4.766667
      mon  0.000000  2.873333
      sat  0.000000  4.310345
      sun  0.025000  4.417500
      thu  0.000000  3.503846
      tue  0.300000  4.567857
      wed  0.000000  3.520000
dec   fri  0.000000  4.900000
      mon  0.000000  8.500000
      sun  0.000000  8.500000
      thu  0.000000  4.900000
      tue  0.000000  8.500000
      wed  0.000000  8.000000
feb   fri  0.000000  4.820000

In [82]:
""" **Pandas Coding Questions - I** """

""" Series Sub-setting
Description
Given a Pandas series and a value 'n', write a program to create a subset of the series whose value is greater than 'n'.



Input: The first line contains a 1D list that will be converted to a Pandas series, and the second line contains an integer 'n'.

Output: Rows of the series whose value is less than n



Sample Input 1: [0, 1,2,3,4,5,6,7,8,9,10]

6

Sample Output 1: 

0  0

1  1

2  2

3  3

4  4

5  5

Sample Input 2: [8, 1,14,0,7,5,6,7,13,9,10]

5

Sample Output 2: 

1  1

3  0  """

" Series Sub-setting\nDescription\nGiven a Pandas series and a value 'n', write a program to create a subset of the series whose value is greater than 'n'.\n\n\n\nInput: The first line contains a 1D list that will be converted to a Pandas series, and the second line contains an integer 'n'.\n\nOutput: Rows of the series whose value is less than n\n\n\n\nSample Input 1: [0, 1,2,3,4,5,6,7,8,9,10]\n\n6\n\nSample Output 1: \n\n0  0\n\n1  1\n\n2  2\n\n3  3\n\n4  4\n\n5  5\n\nSample Input 2: [8, 1,14,0,7,5,6,7,13,9,10]\n\n5\n\nSample Output 2: \n\n1  1\n\n3  0  "

In [86]:
import pandas as pd
import ast
#input has been taken for you
inp_list=ast.literal_eval(input())
n=int(input())
s = pd.Series(inp_list)
#write your code here
print(s[s<n])

1    1
3    0
dtype: int64

In [ ]:
""" Description
Given two Pandas series, s1 and s2, write a program to print the elements of s1 that are not present in s2.

Input: The first line has a 1D list containing elements of the first series, s1 and the second line has another 1D list containing elements of the second series, s2.

Output: Rows of the series whose value.

Sample Input 1: [1, 2, 3, 4, 5]

[2, 4, 6, 8, 10]

Sample Output 1: 

0  1

2  3

4  5

Explanation:

Series 1 and 2 have elements 2 and 4 in common. Hence, the elements that belong to s1 but not s2 are 1, 3 and 5.
 The output is in pandas series format containing the index of the elements also. 

Sample Input 2: [8, 1,14,0,7,5,6,7,13,9,10]

[0, 1,2,3,4,5,6,7,8,9,10]

Sample Output 2: 

2  14

8  13 """

In [8]:
import pandas as pd
import ast
# input has been taken for you
inp_list1=  ast.literal_eval(input())
inp_list2=  ast.literal_eval(input())
s1 = pd.Series(inp_list1)
s2 = pd.Series(inp_list2)

# Write your code here
print(s1[~s1.isin(s2)])

2    14
8    13
dtype: int64

In [ ]:
""" Description
You have been given a dataset called 'heart'. Here are its first few rows:

As you can see, the column names are all lowercase. 
Your task is to capitalize the first character of every column present in it such that your dataframe looks like the following:

You just need to write the code for capitalizing; you need not print anything as the print statement has already been provided in the stub. """
"""https://stackoverflow.com/questions/31269216/applying-uppercase-to-a-column-in-pandas-dataframe"""

In [9]:
# Importing the pandas package
import pandas as pd
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
# Reading the dataframe
df = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/XWvQjYY4LZWdxLvPWOj2pPwn/heart.csv')

# Write your code here
df.columns = map(lambda x: str(x).capitalize(),df.columns)

# Printing the final columns. Do not edit this part.
print(df.columns)

Index(['Age', 'Sex', 'Cp', 'Trestbps', 'Chol', 'Fbs', 'Restecg', 'Thalach',
       'Exang', 'Oldpeak', 'Slope', 'Ca', 'Thal', 'Target'],
      dtype='object')

In [ ]:
""" Description
You've been given the pima_indian_diabetes dataset. Here are its first few rows:
Notice the BMI and Diabetes column. You need to find the BMI which is most likely to cause Diabetes. 
First round the BMI to an integer value and return which BMI has the most risk of diabetes based on the 0, 1 diabetes values provided in the dataframe.

Expected Output: Just print a single integer denoting the value of the required BMI. 
(Please only output an integer value. For example, if the output is 30.0 please convert it to int and output 30.).  """

In [71]:
# Import the Pandas package
import pandas as pd 
import numpy as np
import ssl
ssl._create_default_https_context = ssl._create_unverified_context
# Reading the input dataframe
pima = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/pLZK3n22ezVwAG2XOYW5qEx7V/pima_indian_diabetes.csv')
pima['BMI']=pima['BMI'].apply(lambda x : int(x))
pimadf=pima[pima['Diabetes']==1]
pimadf1= pimadf['BMI'].median()
print(np.int64(pimadf1))
# Write your code here

34

In [ ]:
""" You're given a movies dataframe which contains quite a few aspects of some movies from 1916-2016. Here are the first few rows of the dataframe.
There are a lot of columns that aren't visible. But you might have noticed straight away that there are quite a few missing values in the data frame. Two columns for instance, 'aspect_ratio' and 'facenumber_in_poster' also have a few missing values(NaN). Now, replace the missing values with the 'median' value of the respective columns and print the null value count for both.



Expected Output: First print the number of missing values in both of these columns, then output the median in both the columns and then impute the missing values with the respective medians and print the count of missing values again. Store all of these in a dictionary format like the following:



{'aspect_ratio_mv': 431, 'facenumber_in_poster_mv': 97}

{'aspect_ratio_median: 1.44, 'facenumber_in_poster': 2.0}

{'aspect_ratio_final': 0, 'facenumber_in_poster_final': 0}



The code for the same has been provided in the stub; you just need to complete these dictionaries.



Note: You don't need to use any print statement. The print statements have already been written; you just need to complete the dictionaries provided in the stub. """

In [96]:
# Importing the pandas package
import pandas as pd 

# Reading the movies dataframe
movies = pd.read_csv('movie_data.csv')

# Your aim is to complete the following three print statements after all the colons

mv = {'aspect_ratio_mv': movies['aspect_ratio'].isnull().sum(), 'facenumber_in_poster_mv': movies['facenumber_in_poster'].isnull().sum() }
median = {'aspect_ratio_median': movies['aspect_ratio'].median(), 'facenumber_in_poster_median': movies['facenumber_in_poster'].median()}
movies['aspect_ratio']=movies['aspect_ratio'].fillna(median['aspect_ratio_median'])
movies['facenumber_in_poster']=movies['facenumber_in_poster'].fillna(median['facenumber_in_poster_median'])
final = {'aspect_ratio_final':movies['aspect_ratio'].isnull().sum() , 'facenumber_in_poster_final':movies['facenumber_in_poster'].isnull().sum() }

# Printing the values in the three dictionaries. Please do not edit this part
print(sorted(mv.values()))
print(sorted(median.values()))
print(sorted(final.values()))

[13, 329]
[1.0, 2.35]
[0, 0]

In [ ]:
""" Removing Missing Values
Description
Consider the movie dataset again. Here are the first few rows of the same:

Now, while you imputed missing values in the last question, there are a few columns for which imputing the missing values won't be wise and it's better just to drop them. 

There are two columns 'actor_1_facebook_likes' and 'actor_2_facebook_likes' which have quite a few missing values but since you have less data points,
you don't want to drop many of them. For a hypothetical analysis that you're conducting, it will be okay if one of them has a missing value but you can't afford to have both missing values. So your aim here is to find the indices of the rows in which both of these columns have missing values simultaneously.

Expected Output:
- First print the indices of the rows where both these columns have missing values. The print statement has been provided in the stub. 
You just need to fill it. 
- After you have printed the above indices, drop these particular rows and print the number of retained rows in the dataframe.

A sample output would look like the following:
[389, 1019, 1178, 3400, 4012]
4847

Here, the list in the first line indicates a sample list which indicates the indices of the rows where both of the columns have missing values.
And the second line represents the number of rows remaining in the dataframe after you have dropped the above rows. """

In [123]:
# Importing the pandas package
import pandas as pd 
import requests
import io
c = requests.get('https://media-doselect.s3.amazonaws.com/generic/ZY9xWvEzMB7NEoW08r52L8j2O/movie_data (1).csv')
s = c.content

# Reading the dataframe
movies = pd.read_csv(io.StringIO(s.decode('utf-8')))

# Print out the indices of the rows in which both these columns have missing values
# as a list
print(list( movies[(movies['actor_1_facebook_likes'].isnull()) & (movies['actor_1_facebook_likes'].isnull())].index.values ))
dropindex= list( movies[(movies['actor_1_facebook_likes'].isnull()) & (movies['actor_1_facebook_likes'].isnull())].index.values)
# Write your code for dropping these particular rows here
movies.drop(index=dropindex,axis=0,inplace=True) 

# Print the number of remaining rows
print(movies.shape[0])

[4502, 4519, 4720, 4837, 4945, 4946, 4990]
5036

In [ ]:
""" This time you've a fully cleaned movie dataset. The first few rows of the dataset are shown below:
You're a producer looking to make a blockbuster movie. 
There will primarily be three lead roles in your movie and you wish to cast the most popular actors for it.
Now, since you don't want to take a risk, you will cast a trio which has already acted in together in a movie before. 
The metric that you've chosen to check the popularity is the Facebook likes of each of these actors.

The dataframe has three columns to help you out for the same, viz. 'actor_1_facebook_likes', 'actor_2_facebook_likes',
 and 'actor_3_facebook_likes'. Your objective is to find the trio which has the most number of Facebook likes combined.
But there is a small condition which is that none of the three actors' Facebook likes should be less than half of the other two. For example, the following is a valid combo:
actor_1_facebook_likes: 70000
actor_2_facebook_likes: 40000
actor_3_facebook_likes: 50000

But the below one is not:
actor_1_facebook_likes: 70000
actor_2_facebook_likes: 40000
actor_3_facebook_likes: 30000

since in this case, actor_3_facebook_likes is 30000, which is less than half of actor_1_facebook_likes.

Expected Output: Find out the most popular trio and print them as a list sorted in alphabetical order. For example:
['Brad Pitt', 'Jake Gyllenhaal' 'Meryl Streep'] """

In [194]:
# Importing the pandas package
import pandas as pd

# Reading the movies file
#movies = pd.read_csv(io.StringIO(s.decode('utf-8')))
movies=pd.read_csv('movies_final (2).csv', sep='\t')
 # Write your code here
movies["likesum"] = movies["actor_1_facebook_likes"] + movies["actor_2_facebook_likes"] + movies["actor_3_facebook_likes"]
df=movies[(movies["actor_1_facebook_likes"] > movies["actor_2_facebook_likes"]/2)&(movies["actor_1_facebook_likes"] > movies["actor_3_facebook_likes"]/2)&(movies["actor_2_facebook_likes"] > movies["actor_1_facebook_likes"]/2)&(movies["actor_2_facebook_likes"] > movies["actor_3_facebook_likes"]/2)&(movies["actor_3_facebook_likes"] > movies["actor_1_facebook_likes"]/2)&(movies["actor_3_facebook_likes"] > movies["actor_2_facebook_likes"]/2)]
df = df.sort_values(by="likesum",ascending=False)
fin = dict(df.loc[0,["actor_1_name","actor_2_name","actor_3_name"]])
list(fin.values())

['CCH Pounder', 'Joel David Moore', 'Wes Studi']

In [196]:
# Importing the pandas package
import pandas as pd

# Reading the movies file
movies=pd.read_csv('movies_final (2).csv', sep='\t')

# Group the dataframe using the actor names as indices and facebook likes as values
group = movies.pivot_table(values = ['actor_1_facebook_likes', 'actor_2_facebook_likes', 'actor_3_facebook_likes'],
                           index = ['actor_1_name', 'actor_2_name', 'actor_3_name'], aggfunc='sum')
                           
# Create a new column 'Total likes' which will contain the sum of likes of all three actors 
group['Total likes'] = group['actor_1_facebook_likes'] + group['actor_2_facebook_likes'] + group['actor_3_facebook_likes']

# Sort the dataframe using the 'Total likes' column
group.sort_values(by=['Total likes'], inplace=True, ascending = False)

# Reset the index of the grouped dataframe so you can access the indices as columns easily
group.reset_index(inplace=True)

# Initialise the value of a variable 'j' to 0. This variable will be used to keep
# a track of the rows during the loop iteration
j = 0

# Run a loop through the length of the column 'Total likes'
for i in group['Total likes']:
# Sort the facebook likes of three actors and store them in a variable 'temp'    
    temp = sorted([group.loc[j,'actor_1_facebook_likes'], group.loc[j,'actor_2_facebook_likes'], group.loc[j,'actor_3_facebook_likes']])

# Check if the smallest value in temp is greater than half the value of the other two
# And also check if the middle value is greater than half the value of the max value
    if temp[0] >= temp[1]/2 and temp[0] >= temp[2]/2 and temp[1] >= temp[2]/2:
# If the above condition satisfies, print the correspoding actor names as a sorted list 
# and break the loop
        print(sorted([group.loc[j, 'actor_1_name'], group.loc[j, 'actor_2_name'], group.loc[j, 'actor_3_name']]))
        break
# Keep incrementing the value of j with every loop interation    
    j += 1

                                                     actor_1_facebook_likes  \
actor_1_name    actor_2_name    actor_3_name
50 Cent         Bill Duke       Marc John Jefferies                  1000.0
Aaliyah         Lena Olin       Bruce Spence                          775.0
Aasif Mandvi    Dequina Moore   Jordan Carlos                         346.0
Abbie Cornish   Gabourey Sidibe Michael Stuhlbarg                    2000.0
                Paul Schneider  Samuel Roukin                        2000.0
...                                                                     ...
Zooey Deschanel Rip Torn        Kelly Preston                       11000.0
                Will Ferrell    Dallas Roberts                      11000.0
Zoë Kravitz     Jeremy Davies   Jim Gaffigan                          943.0
                Lily Rabe       Bob Balaban                           943.0
Óscar Jaenada   Brett Cullen    Sedona Legge                          619.0

                                                     actor_2_facebook_likes  \
actor_1_name    actor_2_name    actor_3_name
50 Cent         Bill Duke       Marc John Jefferies                  1000.0
Aaliyah         Lena Olin       Bruce Spence                          541.0
Aasif Mandvi    Dequina Moore   Jordan Carlos                          41.0
Abbie Cornish   Gabourey Sidibe Michael Stuhlbarg                     906.0
                Paul Schneider  Samuel Roukin                         552.0
...                                                                     ...
Zooey Deschanel Rip Torn        Kelly Preston                         826.0
                Will Ferrell    Dallas Roberts                       8000.0
Zoë Kravitz     Jeremy Davies   Jim Gaffigan                          769.0
                Lily Rabe       Bob Balaban                           763.0
Óscar Jaenada   Brett Cullen    Sedona Legge                          350.0

                                                     actor_3_facebook_likes
actor_1_name    actor_2_name    actor_3_name
50 Cent         Bill Duke       Marc John Jefferies                   441.0
Aaliyah         Lena Olin       Bruce Spence                          531.0
Aasif Mandvi    Dequina Moore   Jordan Carlos                          31.0
Abbie Cornish   Gabourey Sidibe Michael Stuhlbarg                     816.0
                Paul Schneider  Samuel Roukin                         179.0
...                                                                     ...
Zooey Deschanel Rip Torn        Kelly Preston                         742.0
                Will Ferrell    Dallas Roberts                        405.0
Zoë Kravitz     Jeremy Davies   Jim Gaffigan                          472.0
                Lily Rabe       Bob Balaban                           559.0
Óscar Jaenada   Brett Cullen    Sedona Legge                            2.0

[3631 rows x 3 columns]